evaluation_tests/test2_webserver/tc2_js_curve_c16/step01_rps5__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 1418.965ms, rate sampling interval: 4362ms
  Thread calibration: mean lat.: 1196.224ms, rate sampling interval: 4120ms
  Thread calibration: mean lat.: 970.698ms, rate sampling interval: 2910ms
  Thread calibration: mean lat.: 1373.226ms, rate sampling interval: 3633ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.19s   499.78ms   2.40s    75.89%
    Req/Sec     0.89      0.31     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.01s 
 75.000%    1.35s 
 90.000%    2.09s 
 99.000%    2.37s 
 99.900%    2.40s 
 99.990%    2.40s 
 99.999%    2.40s 
100.000%    2.40s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     594.431     0.000000            1         1.00
     726.527     0.100000           12         1.11
     816.639     0.200000           23         1.25
     861.183     0.300000           34         1.43
     921.087     0.400000           45         1.67
    1009.151     0.500000           56         2.00
    1038.335     0.550000           62         2.22
    1144.831     0.600000           68         2.50
    1253.375     0.650000           73         2.86
    1297.407     0.700000           79         3.33
    1353.727     0.750000           84         4.00
    1459.199     0.775000           87         4.44
    1635.327     0.800000           90         5.00
    1683.455     0.825000           93         5.71
    1813.503     0.850000           96         6.67
    1995.775     0.875000           98         8.00
    2085.887     0.887500          100         8.89
    2091.007     0.900000          101        10.00
    2191.359     0.912500          103        11.43
    2213.887     0.925000          104        13.33
    2289.663     0.937500          106        16.00
    2289.663     0.943750          106        17.78
    2295.807     0.950000          108        20.00
    2295.807     0.956250          108        22.86
    2295.807     0.962500          108        26.67
    2312.191     0.968750          109        32.00
    2312.191     0.971875          109        35.56
    2320.383     0.975000          110        40.00
    2320.383     0.978125          110        45.71
    2320.383     0.981250          110        53.33
    2371.583     0.984375          111        64.00
    2371.583     0.985938          111        71.11
    2371.583     0.987500          111        80.00
    2371.583     0.989062          111        91.43
    2371.583     0.990625          111       106.67
    2404.351     0.992188          112       128.00
    2404.351     1.000000          112          inf
#[Mean    =     1191.506, StdDeviation   =      499.783]
#[Max     =     2402.304, Total count    =          112]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  160 requests in 30.03s, 32.55MB read
  Socket errors: connect 0, read 0, write 0, timeout 80
Requests/sec:      5.33
Transfer/sec:      1.08MB