evaluation_tests/test2_webserver/tc2_js_curve_c16/step02_rps10__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 874.944ms, rate sampling interval: 2297ms
  Thread calibration: mean lat.: 980.634ms, rate sampling interval: 2744ms
  Thread calibration: mean lat.: 951.733ms, rate sampling interval: 2441ms
  Thread calibration: mean lat.: 840.128ms, rate sampling interval: 2050ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   826.56ms  174.48ms   1.50s    70.05%
    Req/Sec     1.94      0.79     3.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  826.37ms
 75.000%  925.70ms
 90.000%    1.05s 
 99.000%    1.34s 
 99.900%    1.50s 
 99.990%    1.50s 
 99.999%    1.50s 
100.000%    1.50s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     462.079     0.000000            1         1.00
     627.199     0.100000           20         1.11
     673.791     0.200000           40         1.25
     705.535     0.300000           60         1.43
     757.247     0.400000           79         1.67
     826.367     0.500000           99         2.00
     845.823     0.550000          109         2.22
     854.015     0.600000          119         2.50
     871.423     0.650000          129         2.86
     895.487     0.700000          138         3.33
     925.695     0.750000          148         4.00
     934.911     0.775000          153         4.44
     951.807     0.800000          158         5.00
     975.359     0.825000          163         5.71
     985.087     0.850000          168         6.67
    1035.263     0.875000          173         8.00
    1044.479     0.887500          175         8.89
    1056.767     0.900000          178        10.00
    1071.103     0.912500          180        11.43
    1093.631     0.925000          183        13.33
    1101.823     0.937500          185        16.00
    1102.847     0.943750          186        17.78
    1170.431     0.950000          188        20.00
    1171.455     0.956250          189        22.86
    1177.599     0.962500          190        26.67
    1197.055     0.968750          191        32.00
    1205.247     0.971875          192        35.56
    1211.391     0.975000          193        40.00
    1211.391     0.978125          193        45.71
    1334.271     0.981250          194        53.33
    1334.271     0.984375          194        64.00
    1335.295     0.985938          195        71.11
    1335.295     0.987500          195        80.00
    1335.295     0.989062          195        91.43
    1367.039     0.990625          196       106.67
    1367.039     0.992188          196       128.00
    1367.039     0.992969          196       142.22
    1367.039     0.993750          196       160.00
    1367.039     0.994531          196       182.86
    1500.159     0.995313          197       213.33
    1500.159     1.000000          197          inf
#[Mean    =      826.556, StdDeviation   =      174.481]
#[Max     =     1499.136, Total count    =          197]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  293 requests in 30.03s, 61.09MB read
Requests/sec:      9.76
Transfer/sec:      2.03MB