evaluation_tests/test2_webserver/tc2_js_curve_c16/step03_rps12__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 706.405ms, rate sampling interval: 1848ms
  Thread calibration: mean lat.: 950.372ms, rate sampling interval: 2945ms
  Thread calibration: mean lat.: 822.262ms, rate sampling interval: 2029ms
  Thread calibration: mean lat.: 710.055ms, rate sampling interval: 1753ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   739.12ms  328.28ms   2.47s    84.90%
    Req/Sec     2.36      0.71     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  656.90ms
 75.000%  805.38ms
 90.000%    1.09s 
 99.000%    2.35s 
 99.900%    2.47s 
 99.990%    2.47s 
 99.999%    2.47s 
100.000%    2.47s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     346.111     0.000000            1         1.00
     487.423     0.100000           26         1.11
     519.935     0.200000           49         1.25
     553.983     0.300000           74         1.43
     614.399     0.400000           98         1.67
     656.895     0.500000          123         2.00
     691.711     0.550000          135         2.22
     714.239     0.600000          147         2.50
     759.807     0.650000          160         2.86
     782.847     0.700000          172         3.33
     805.375     0.750000          184         4.00
     827.391     0.775000          190         4.44
     832.511     0.800000          196         5.00
     851.967     0.825000          203         5.71
     919.551     0.850000          209         6.67
    1005.055     0.875000          215         8.00
    1031.167     0.887500          218         8.89
    1094.655     0.900000          221        10.00
    1142.783     0.912500          224        11.43
    1218.559     0.925000          227        13.33
    1246.207     0.937500          230        16.00
    1273.855     0.943750          232        17.78
    1300.479     0.950000          233        20.00
    1392.639     0.956250          235        22.86
    1469.439     0.962500          236        26.67
    1629.183     0.968750          238        32.00
    1759.231     0.971875          239        35.56
    1759.231     0.975000          239        40.00
    1913.855     0.978125          240        45.71
    1942.527     0.981250          241        53.33
    2016.255     0.984375          242        64.00
    2016.255     0.985938          242        71.11
    2016.255     0.987500          242        80.00
    2351.103     0.989062          243        91.43
    2351.103     0.990625          243       106.67
    2447.359     0.992188          244       128.00
    2447.359     0.992969          244       142.22
    2447.359     0.993750          244       160.00
    2447.359     0.994531          244       182.86
    2447.359     0.995313          244       213.33
    2467.839     0.996094          245       256.00
    2467.839     1.000000          245          inf
#[Mean    =      739.123, StdDeviation   =      328.276]
#[Max     =     2465.792, Total count    =          245]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  359 requests in 30.02s, 73.98MB read
Requests/sec:     11.96
Transfer/sec:      2.46MB