evaluation_tests/test2_webserver/tc2_js_curve_c16/step04_rps14__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 755.320ms, rate sampling interval: 1911ms
  Thread calibration: mean lat.: 743.614ms, rate sampling interval: 2001ms
  Thread calibration: mean lat.: 670.619ms, rate sampling interval: 1972ms
  Thread calibration: mean lat.: 782.006ms, rate sampling interval: 2248ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.23s     1.06s    6.36s    89.51%
    Req/Sec     3.19      0.83     4.00     97.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  844.29ms
 75.000%    1.14s 
 90.000%    2.35s 
 99.000%    5.64s 
 99.900%    6.36s 
 99.990%    6.36s 
 99.999%    6.36s 
100.000%    6.36s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     413.695     0.000000            1         1.00
     562.175     0.100000           29         1.11
     655.871     0.200000           58         1.25
     715.263     0.300000           86         1.43
     789.503     0.400000          115         1.67
     844.287     0.500000          143         2.00
     883.199     0.550000          158         2.22
     931.839     0.600000          172         2.50
     973.823     0.650000          186         2.86
    1038.335     0.700000          201         3.33
    1141.759     0.750000          215         4.00
    1200.127     0.775000          222         4.44
    1420.287     0.800000          229         5.00
    1610.751     0.825000          236         5.71
    1981.439     0.850000          244         6.67
    2177.023     0.875000          251         8.00
    2217.983     0.887500          254         8.89
    2732.031     0.900000          258        10.00
    2942.975     0.912500          261        11.43
    3323.903     0.925000          265        13.33
    3450.879     0.937500          269        16.00
    3518.463     0.943750          270        17.78
    3608.575     0.950000          272        20.00
    3678.207     0.956250          274        22.86
    3936.255     0.962500          276        26.67
    4093.951     0.968750          278        32.00
    4093.951     0.971875          278        35.56
    4132.863     0.975000          279        40.00
    4636.671     0.978125          280        45.71
    5197.823     0.981250          281        53.33
    5591.039     0.984375          282        64.00
    5591.039     0.985938          282        71.11
    5640.191     0.987500          283        80.00
    5640.191     0.989062          283        91.43
    6143.999     0.990625          284       106.67
    6143.999     0.992188          284       128.00
    6143.999     0.992969          284       142.22
    6209.535     0.993750          285       160.00
    6209.535     0.994531          285       182.86
    6209.535     0.995313          285       213.33
    6209.535     0.996094          285       256.00
    6209.535     0.996484          285       284.44
    6361.087     0.996875          286       320.00
    6361.087     1.000000          286          inf
#[Mean    =     1232.987, StdDeviation   =     1057.048]
#[Max     =     6356.992, Total count    =          286]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  416 requests in 30.02s, 85.58MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:     13.86
Transfer/sec:      2.85MB